In [1]:
import numpy as np
import pandas as pd

/Users/daishin1029/.pyenv/versions/3.8.5/lib/python3.8/site-packages/pandas/compat/__init__.py:120: UserWarning: Could not import the lzma module. Your installed Python is incomplete. Attempting to use lzma compression will result in a RuntimeError.
  warnings.warn(msg)

In [2]:
s = pd.Series([1,3,5, np.nan, 6, 8])

In [3]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [5]:
dates = pd.date_range( '20130101',  periods=6)

In [6]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [11]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates,  columns=list('ABCD'))

In [12]:
df

                   A         B         C         D
2013-01-01  0.427853 -0.596472 -0.439085  0.035278
2013-01-02  0.736811 -0.949833 -0.987269  1.650884
2013-01-03  1.301853 -0.030467  0.543276 -1.431537
2013-01-04 -0.900465  0.047591  0.402837 -0.999534
2013-01-05  0.055291  0.967559  0.600941  1.428053
2013-01-06 -1.592014  1.154639 -0.144506 -0.701337

In [19]:
df2 = pd.DataFrame(({'A': 1.,
                                        'B': pd.Timestamp('20130102'),
                                        'C': pd.Series(1,  index=list(range(4)), dtype='float32'),
                                        'D': np.array([3] * 4, dtype='int32'),
                                        'E': pd.Categorical(["test", "train", "test", "train"]),
                                        'F': 'foo'}))
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [14]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [20]:
 df.head()

                   A         B         C         D
2013-01-01  0.427853 -0.596472 -0.439085  0.035278
2013-01-02  0.736811 -0.949833 -0.987269  1.650884
2013-01-03  1.301853 -0.030467  0.543276 -1.431537
2013-01-04 -0.900465  0.047591  0.402837 -0.999534
2013-01-05  0.055291  0.967559  0.600941  1.428053

In [21]:
df.tail(3)

                   A         B         C         D
2013-01-04 -0.900465  0.047591  0.402837 -0.999534
2013-01-05  0.055291  0.967559  0.600941  1.428053
2013-01-06 -1.592014  1.154639 -0.144506 -0.701337

In [22]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [23]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [24]:
df.to_numpy()

array([[ 0.42785305, -0.59647205, -0.43908518,  0.03527838],
       [ 0.73681073, -0.9498332 , -0.98726929,  1.65088433],
       [ 1.30185295, -0.03046722,  0.54327627, -1.43153748],
       [-0.90046473,  0.04759111,  0.40283674, -0.99953431],
       [ 0.05529051,  0.96755861,  0.60094137,  1.42805299],
       [-1.5920135 ,  1.15463877, -0.14450583, -0.70133658]])

In [25]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [26]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.004888  0.098836 -0.003968 -0.003032
std    1.074153  0.833295  0.633536  1.288890
min   -1.592014 -0.949833 -0.987269 -1.431537
25%   -0.661526 -0.454971 -0.365440 -0.924985
50%    0.241572  0.008562  0.129165 -0.333029
75%    0.659571  0.737567  0.508166  1.079859
max    1.301853  1.154639  0.600941  1.650884

In [27]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.427853    0.736811    1.301853   -0.900465    0.055291   -1.592014
B   -0.596472   -0.949833   -0.030467    0.047591    0.967559    1.154639
C   -0.439085   -0.987269    0.543276    0.402837    0.600941   -0.144506
D    0.035278    1.650884   -1.431537   -0.999534    1.428053   -0.701337

In [28]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.035278 -0.439085 -0.596472  0.427853
2013-01-02  1.650884 -0.987269 -0.949833  0.736811
2013-01-03 -1.431537  0.543276 -0.030467  1.301853
2013-01-04 -0.999534  0.402837  0.047591 -0.900465
2013-01-05  1.428053  0.600941  0.967559  0.055291
2013-01-06 -0.701337 -0.144506  1.154639 -1.592014

In [29]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-02  0.736811 -0.949833 -0.987269  1.650884
2013-01-01  0.427853 -0.596472 -0.439085  0.035278
2013-01-03  1.301853 -0.030467  0.543276 -1.431537
2013-01-04 -0.900465  0.047591  0.402837 -0.999534
2013-01-05  0.055291  0.967559  0.600941  1.428053
2013-01-06 -1.592014  1.154639 -0.144506 -0.701337